{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv1_1", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act1_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act1_1", 
      "inputs": [[3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn1_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn1_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn1_1", 
      "inputs": [[5, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv1_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv1_2", 
      "inputs": [[8, 0], [9, 0], [10, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act1_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act1_2", 
      "inputs": [[11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn1_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn1_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn1_2", 
      "inputs": [[13, 0], [14, 0], [15, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pool1", 
      "inputs": [[16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.25"}, 
      "name": "dropout0", 
      "inputs": [[17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv2_1", 
      "inputs": [[18, 0], [19, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act2_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act2_1", 
      "inputs": [[21, 0], [22, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn2_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn2_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn2_1", 
      "inputs": [[23, 0], [24, 0], [25, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv2_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv2_2", 
      "inputs": [[26, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act2_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act2_2", 
      "inputs": [[29, 0], [30, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn2_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn2_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn2_2", 
      "inputs": [[31, 0], [32, 0], [33, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pool2", 
      "inputs": [[34, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.25"}, 
      "name": "dropout1", 
      "inputs": [[35, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv3_1", 
      "inputs": [[36, 0], [37, 0], [38, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act3_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act3_1", 
      "inputs": [[39, 0], [40, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn3_1", 
      "inputs": [[41, 0], [42, 0], [43, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv3_2", 
      "inputs": [[44, 0], [45, 0], [46, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act3_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act3_2", 
      "inputs": [[47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn3_2", 
      "inputs": [[49, 0], [50, 0], [51, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv3_3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv3_3", 
      "inputs": [[52, 0], [53, 0], [54, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act3_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act3_3", 
      "inputs": [[55, 0], [56, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn3_3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn3_3", 
      "inputs": [[57, 0], [58, 0], [59, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pool3", 
      "inputs": [[60, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.25"}, 
      "name": "dropout2", 
      "inputs": [[61, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv4_1", 
      "inputs": [[62, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act4_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act4_1", 
      "inputs": [[65, 0], [66, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn4_1", 
      "inputs": [[67, 0], [68, 0], [69, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv4_2", 
      "inputs": [[70, 0], [71, 0], [72, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act4_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act4_2", 
      "inputs": [[73, 0], [74, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn4_2", 
      "inputs": [[75, 0], [76, 0], [77, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv4_3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv4_3", 
      "inputs": [[78, 0], [79, 0], [80, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act4_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act4_3", 
      "inputs": [[81, 0], [82, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn4_3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn4_3", 
      "inputs": [[83, 0], [84, 0], [85, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pool3", 
      "inputs": [[86, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.25"}, 
      "name": "dropout3", 
      "inputs": [[87, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv5_1", 
      "inputs": [[88, 0], [89, 0], [90, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act5_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act5_1", 
      "inputs": [[91, 0], [92, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn5_1", 
      "inputs": [[93, 0], [94, 0], [95, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv5_2", 
      "inputs": [[96, 0], [97, 0], [98, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act5_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act5_2", 
      "inputs": [[99, 0], [100, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn5_2", 
      "inputs": [[101, 0], [102, 0], [103, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv5_3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "conv5_3", 
      "inputs": [[104, 0], [105, 0], [106, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act5_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act5_3", 
      "inputs": [[107, 0], [108, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn5_3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn5_3", 
      "inputs": [[109, 0], [110, 0], [111, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pool5", 
      "inputs": [[112, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.25"}, 
      "name": "dropout4", 
      "inputs": [[113, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Flatten", 
      "param": {}, 
      "name": "flatten", 
      "inputs": [[114, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "4096"
      }, 
      "name": "fc1", 
      "inputs": [[115, 0], [116, 0], [117, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act6_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act6_1", 
      "inputs": [[118, 0], [119, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn6_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn6_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn6_1", 
      "inputs": [[120, 0], [121, 0], [122, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.5"}, 
      "name": "dropout5", 
      "inputs": [[123, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "4096"
      }, 
      "name": "fc2", 
      "inputs": [[124, 0], [125, 0], [126, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "act7_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "LeakyReLU", 
      "param": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "name": "act7_1", 
      "inputs": [[127, 0], [128, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn7_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn7_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "bn7_1", 
      "inputs": [[129, 0], [130, 0], [131, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Dropout", 
      "param": {"p": "0.5"}, 
      "name": "dropout6", 
      "inputs": [[132, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1000"
      }, 
      "name": "fc3", 
      "inputs": [[133, 0], [134, 0], [135, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "softmax_label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "SoftmaxOutput", 
      "param": {
        "grad_scale": "1", 
        "ignore_label": "-1", 
        "multi_output": "False", 
        "normalization": "null", 
        "out_grad": "False", 
        "preserve_shape": "False", 
        "use_ignore": "False"
      }, 
      "name": "softmax", 
      "inputs": [[136, 0], [137, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    6, 
    7, 
    9, 
    10, 
    12, 
    14, 
    15, 
    19, 
    20, 
    22, 
    24, 
    25, 
    27, 
    28, 
    30, 
    32, 
    33, 
    37, 
    38, 
    40, 
    42, 
    43, 
    45, 
    46, 
    48, 
    50, 
    51, 
    53, 
    54, 
    56, 
    58, 
    59, 
    63, 
    64, 
    66, 
    68, 
    69, 
    71, 
    72, 
    74, 
    76, 
    77, 
    79, 
    80, 
    82, 
    84, 
    85, 
    89, 
    90, 
    92, 
    94, 
    95, 
    97, 
    98, 
    100, 
    102, 
    103, 
    105, 
    106, 
    108, 
    110, 
    111, 
    116, 
    117, 
    119, 
    121, 
    122, 
    125, 
    126, 
    128, 
    130, 
    131, 
    134, 
    135, 
    137
  ], 
  "heads": [[138, 0]]
}