{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm0_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm0_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm0", 
      "inputs": [[0, 0], [1, 0], [2, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution0_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution0", 
      "inputs": [[3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm1", 
      "inputs": [[5, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation0", 
      "inputs": [[8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "name": "pooling0", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm2", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation1", 
      "inputs": [[13, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution1", 
      "inputs": [[14, 0], [15, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm3", 
      "inputs": [[16, 0], [17, 0], [18, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation2", 
      "inputs": [[19, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution2", 
      "inputs": [[20, 0], [21, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm4_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm4_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm4", 
      "inputs": [[22, 0], [23, 0], [24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation3", 
      "inputs": [[25, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution3", 
      "inputs": [[26, 0], [27, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution4_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution4", 
      "inputs": [[14, 0], [29, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[28, 0], [30, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm5_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm5_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm5", 
      "inputs": [[31, 0], [32, 0], [33, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation4", 
      "inputs": [[34, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution5_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution5", 
      "inputs": [[35, 0], [36, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm6_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm6_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm6", 
      "inputs": [[37, 0], [38, 0], [39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation5", 
      "inputs": [[40, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution6_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution6", 
      "inputs": [[41, 0], [42, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm7_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm7_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm7", 
      "inputs": [[43, 0], [44, 0], [45, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation6", 
      "inputs": [[46, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution7_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution7", 
      "inputs": [[47, 0], [48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus1", 
      "inputs": [[49, 0], [31, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm8_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm8_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm8", 
      "inputs": [[50, 0], [51, 0], [52, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation7", 
      "inputs": [[53, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution8_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution8", 
      "inputs": [[54, 0], [55, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm9_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm9_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm9", 
      "inputs": [[56, 0], [57, 0], [58, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation8", 
      "inputs": [[59, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution9_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution9", 
      "inputs": [[60, 0], [61, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm10_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm10_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm10", 
      "inputs": [[62, 0], [63, 0], [64, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation9", 
      "inputs": [[65, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution10_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution10", 
      "inputs": [[66, 0], [67, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus2", 
      "inputs": [[68, 0], [50, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm11_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm11_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm11", 
      "inputs": [[69, 0], [70, 0], [71, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation10", 
      "inputs": [[72, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution11_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution11", 
      "inputs": [[73, 0], [74, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm12_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm12_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm12", 
      "inputs": [[75, 0], [76, 0], [77, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation11", 
      "inputs": [[78, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution12_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution12", 
      "inputs": [[79, 0], [80, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm13_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm13_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm13", 
      "inputs": [[81, 0], [82, 0], [83, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation12", 
      "inputs": [[84, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution13_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution13", 
      "inputs": [[85, 0], [86, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution14_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution14", 
      "inputs": [[73, 0], [88, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus3", 
      "inputs": [[87, 0], [89, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm14_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm14_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm14", 
      "inputs": [[90, 0], [91, 0], [92, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation13", 
      "inputs": [[93, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution15_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution15", 
      "inputs": [[94, 0], [95, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm15_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm15", 
      "inputs": [[96, 0], [97, 0], [98, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation14", 
      "inputs": [[99, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution16_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution16", 
      "inputs": [[100, 0], [101, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm16_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm16_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm16", 
      "inputs": [[102, 0], [103, 0], [104, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation15", 
      "inputs": [[105, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution17_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution17", 
      "inputs": [[106, 0], [107, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus4", 
      "inputs": [[108, 0], [90, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm17_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm17_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm17", 
      "inputs": [[109, 0], [110, 0], [111, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation16", 
      "inputs": [[112, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution18_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution18", 
      "inputs": [[113, 0], [114, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm18_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm18_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm18", 
      "inputs": [[115, 0], [116, 0], [117, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation17", 
      "inputs": [[118, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution19_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution19", 
      "inputs": [[119, 0], [120, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm19_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm19_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm19", 
      "inputs": [[121, 0], [122, 0], [123, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation18", 
      "inputs": [[124, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution20_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution20", 
      "inputs": [[125, 0], [126, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus5", 
      "inputs": [[127, 0], [109, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm20_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm20_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm20", 
      "inputs": [[128, 0], [129, 0], [130, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation19", 
      "inputs": [[131, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution21_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution21", 
      "inputs": [[132, 0], [133, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm21_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm21_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm21", 
      "inputs": [[134, 0], [135, 0], [136, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation20", 
      "inputs": [[137, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution22_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution22", 
      "inputs": [[138, 0], [139, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm22_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm22_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm22", 
      "inputs": [[140, 0], [141, 0], [142, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation21", 
      "inputs": [[143, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution23_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution23", 
      "inputs": [[144, 0], [145, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus6", 
      "inputs": [[146, 0], [128, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm23_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm23_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm23", 
      "inputs": [[147, 0], [148, 0], [149, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation22", 
      "inputs": [[150, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution24_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution24", 
      "inputs": [[151, 0], [152, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm24_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm24_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm24", 
      "inputs": [[153, 0], [154, 0], [155, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation23", 
      "inputs": [[156, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution25_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution25", 
      "inputs": [[157, 0], [158, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm25_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm25_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm25", 
      "inputs": [[159, 0], [160, 0], [161, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation24", 
      "inputs": [[162, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution26_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution26", 
      "inputs": [[163, 0], [164, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution27_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "1024"
      }, 
      "name": "convolution27", 
      "inputs": [[151, 0], [166, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus7", 
      "inputs": [[165, 0], [167, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm26_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm26_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm26", 
      "inputs": [[168, 0], [169, 0], [170, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation25", 
      "inputs": [[171, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution28_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution28", 
      "inputs": [[172, 0], [173, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm27_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm27_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm27", 
      "inputs": [[174, 0], [175, 0], [176, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation26", 
      "inputs": [[177, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution29_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution29", 
      "inputs": [[178, 0], [179, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm28_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm28_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm28", 
      "inputs": [[180, 0], [181, 0], [182, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation27", 
      "inputs": [[183, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution30_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution30", 
      "inputs": [[184, 0], [185, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus8", 
      "inputs": [[186, 0], [168, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm29_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm29_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm29", 
      "inputs": [[187, 0], [188, 0], [189, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation28", 
      "inputs": [[190, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution31_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution31", 
      "inputs": [[191, 0], [192, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm30_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm30_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm30", 
      "inputs": [[193, 0], [194, 0], [195, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation29", 
      "inputs": [[196, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution32_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution32", 
      "inputs": [[197, 0], [198, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm31_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm31_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm31", 
      "inputs": [[199, 0], [200, 0], [201, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation30", 
      "inputs": [[202, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution33_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution33", 
      "inputs": [[203, 0], [204, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus9", 
      "inputs": [[205, 0], [187, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm32_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm32_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm32", 
      "inputs": [[206, 0], [207, 0], [208, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation31", 
      "inputs": [[209, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution34_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution34", 
      "inputs": [[210, 0], [211, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm33_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm33_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm33", 
      "inputs": [[212, 0], [213, 0], [214, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation32", 
      "inputs": [[215, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution35_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "name": "convolution35", 
      "inputs": [[216, 0], [217, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm34_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "batchnorm34_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "batchnorm34", 
      "inputs": [[218, 0], [219, 0], [220, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "activation33", 
      "inputs": [[221, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "convolution36_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0,0)", 
